#!/usr/bin/python
# -*- coding: UTF-8 -*-

stocks_map = [
    {'code': '000001', 'name': '平安银行'}, {'code': '601318', 'name': '中国平安'},
    {'code': '600036', 'name': '招商银行'}, {'code': '600028', 'name': '中国石化'},
    {'code': '601006', 'name': '大秦铁路'}, {'code': '601857', 'name': '中国石油'},
    {'code': '601117', 'name': '中国化学'}, {'code': '002697', 'name': '红旗连锁'},
    {'code': '600556', 'name': '慧球科技'}, {'code': '600680', 'name': '上海普天'},
    {'code': '000693', 'name': 'ST华泽'}, {'code': '600369', 'name': '西南证券'},
    {'code': '600857', 'name': '宁波中百'}, {'code': '002504', 'name': '弘高创意'},
    {'code': '000995', 'name': 'ST皇台'}, {'code': '600958', 'name': '东方证券'},
    {'code': '601211', 'name': '国泰君安'}, {'code': '000798', 'name': '中水渔业'},
    {'code': '002667', 'name': '鞍重股份'}, {'code': '600806', 'name': 'ST昆机'},
    {'code': '000410', 'name': '沈阳机床'}, {'code': '601628', 'name': '中国人寿'},
    {'code': '002565', 'name': '上海绿新'}, {'code': '600490', 'name': '鹏欣资源'},
    {'code': '600652', 'name': '游久游戏'}, {'code': '002219', 'name': '恒康医疗'},
    {'code': '600139', 'name': '西部资源'}, {'code': '000007', 'name': '全新好'},
    {'code': '300395', 'name': '菲利华'}, {'code': '000020', 'name': '深华发Ａ'},
    {'code': '600145', 'name': 'ST新亿'}, {'code': '002566', 'name': '益盛药业'},
    {'code': '002330', 'name': '得利斯'}, {'code': '600078', 'name': '澄星股份'},
    {'code': '603227', 'name': '雪峰科技'}, {'code': '600810', 'name': '神马股份'},
    {'code': '600030', 'name': '中信证券'}, {'code': '600837', 'name': '海通证券'},
    {'code': '300126', 'name': '锐奇股份'}, {'code': '300135', 'name': '宝利国际'},
    {'code': '600601', 'name': '方正科技'}, {'code': '002715', 'name': '登云股份'},
    {'code': '300208', 'name': '恒顺众昇'}, {'code': '002507', 'name': '涪陵榨菜'},
    {'code': '600730', 'name': '中国高科'}, {'code': '600379', 'name': '宝光股份'},
    {'code': '300117', 'name': '嘉寓股份'}, {'code': '300028', 'name': '金亚科技'},
    {'code': '600421', 'name': '仰帆控股'}, {'code': '000788', 'name': '北大医药'},
    {'code': '600247', 'name': 'ST成城'}, {'code': '601558', 'name': '华锐风电'},
    {'code': '000526', 'name': '紫光学大'}
]


def get_exclude_codes():
    codes = [stock['code'] for stock in stocks_map]
    return codes
